Defklol/CNBBM/nRF5-SDK-for-Mesh-master/examples/Clustering_Network/node B/src/main.c
/* Copyright (c) 2010 - 2018, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <stdint.h>
#include <string.h>


#include "boards.h"
#include "simple_hal.h"
#include "log.h"
#include "access_config.h"
#include "simple_battery_client.h"
#include "simple_battery_server.h"
#include "emergency_help_client.h"
#include "emergency_help_server.h"
#include "rtt_input.h"
#include "device_state_manager.h"
#include "light_switch_example_common.h"
#include "mesh_app_utils.h"
#include "mesh_stack.h"
#include "mesh_softdevice_init.h"
#include "mesh_provisionee.h"
#include "nrf_mesh_config_examples.h"
#include "nrf_mesh_configure.h"
#include "mesh_app_utils.h"

#include "advertiser.h"

#include "mesh_adv.h"
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "nrf_sdh_soc.h"
#include "ble_conn_params.h"
#include "sdk_config.h"
#include "proxy.h"

#include "nrf_uart.h"

#include "app_timer.h"
#include "app_uart.h"

#include "nrf_drv_saadc.h"

#define RTT_INPUT_POLL_PERIOD_MS (100)
#define GROUP_MSG_REPEAT_COUNT   (1)

#define LED_BLINK_INTERVAL_MS       (200)
#define LED_BLINK_SHORT_INTERVAL_MS (50)
#define LED_BLINK_CNT_START         (2)
#define LED_BLINK_CNT_RESET         (3)
#define LED_BLINK_CNT_PROV          (4)
#define LED_BLINK_CNT_NO_REPLY      (6)

#define DEVICE_NAME                     "Power Node"
#define MIN_CONN_INTERVAL               MSEC_TO_UNITS(150,  UNIT_1_25_MS)           /**< Minimum acceptable connection interval. */
#define MAX_CONN_INTERVAL               MSEC_TO_UNITS(250,  UNIT_1_25_MS)           /**< Maximum acceptable connection interval. */
#define SLAVE_LATENCY                   0                                           /**< Slave latency. */
#define CONN_SUP_TIMEOUT                MSEC_TO_UNITS(4000, UNIT_10_MS)             /**< Connection supervisory timeout (4 seconds). */
#define FIRST_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(100)                        /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called. */
#define NEXT_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(2000)                       /**< Time between each call to sd_ble_gap_conn_param_update after the first call. */
#define MAX_CONN_PARAMS_UPDATE_COUNT    3                                           /**< Number of attempts before giving up the connection parameter negotiation. */

#define BAT_PUBLISH_INTERVAL            APP_TIMER_TICKS(60000)                          /**< 1(s)* 60* 30*/
#define CH_ELECTION_INTERVAL            APP_TIMER_TICKS(10000)                          /**< 1(s)* 10*/
#define I_AM_CH_INTERVAL                APP_TIMER_TICKS(5000)                           /**< 1(s)* 5*/
#define MN_EXCHANGE_ROUTING_INTERVAL    APP_TIMER_TICKS(5000)                           /**< 1(s)* 5*/

#define UART_TX_BUF_SIZE 256                         /**< UART TX buffer size. */
#define UART_RX_BUF_SIZE 256                         /**< UART RX buffer size. */

#define ADVERTISER_BUF_SIZE (64)
#define BEACON_INTERVAL     (500)

#define CH_ADV_PREFIX   0x02, 0x56, 0xf6, 0xde, 0xde

#define MAJOR_LOCATE_H  0x00
#define MAJOR_LOCATE_L  0x0C
#define MINOR_LOCATE_H  0x02
#define MINOR_LOCATE_L  0x0C

#define BS_RELAY_TIMEOUT  3     //1 times 10s.
#define CH_ELECTION_TIMEOUT   3
#define I_AM_CH_TIMEOUT       3
#define MN_ROUTING_ADV_TIMEOUT  3



APP_TIMER_DEF(m_bat_publish_id);          //Detect battery value and set unreliable msg to BS.
APP_TIMER_DEF(m_ch_election_id);          //Election CH for advertising.
APP_TIMER_DEF(m_i_am_ch_id);              //I am CH for advertising.
APP_TIMER_DEF(m_mn_ex_routing_id);        //MNs exchange destination for advtising.

static nrf_saadc_value_t adc_value;

static void gap_params_init(void);
static void conn_params_init(void);
static void lora_trans(uint8_t device_ID, uint8_t value);

static void adv_init(void);
static void adv_start(void);
static void adv_discard(void);
static void ch_election_adv(uint8_t max_addr_H, uint8_t max_addr_L, uint8_t max_priority);
static void BS_relay_adv(uint8_t rc_level, uint8_t relay_tid);
static void adv_disable(void);
static void i_am_ch_adv(void);
static void mn_routing_adv(void);

