Defklol/CNBBM/nRF5-SDK-for-Mesh-master/examples/Clustering_Network/node B/src/main.c
static advertiser_t m_advertiser;

static uint8_t      m_adv_buffer[ADVERTISER_BUF_SIZE];


static void on_sd_evt(uint32_t sd_evt, void * p_context)
{
    (void) nrf_mesh_on_sd_evt(sd_evt);
}

NRF_SDH_SOC_OBSERVER(mesh_observer, NRF_SDH_BLE_STACK_OBSERVER_PRIO, on_sd_evt, NULL);

static simple_battery_client_t m_bat_clients[1];
static simple_battery_server_t m_bat_servers[1];
static emergency_help_client_t m_emh_clients[1];
static emergency_help_server_t m_emh_servers[1];

static bool                   m_device_provisioned;
static bool                   provision_flag = 0;
static bool                   m_emh_status = 0;  //1: set emh; 0: can set emh.

static uint8_t adv_packet_status = 0;               //Advertising status.

//Struct for storing ch election data.
struct cluster_header
{
    uint16_t  max_addr;
    uint8_t   max_priority;
    uint8_t   self_priority;
};

typedef struct cluster_header CH;
static CH ch = {0};

//Struct for MNs exchange data.
/*
struct mns_exchange_path
{
    uint8_t   ch_flag;
    uint16_t  destination;
    uint8_t   hop;
};

typedef struct mns_exchange_path MN_EXCHANGE_PATH;
static MN_EXCHANGE_PATH mn_ex_path = {0, 0, 255};

//Struct for storing ch destination addr data.
struct ch_exchange_path
{
    uint16_t destination;
    uint8_t  level;
};

typedef struct ch_exchange_path CH_EXCHANGE_PATH;
static CH_EXCHANGE_PATH ch_ex_path = {0, 255};
*/
struct __self_node_attribute
{
    uint16_t    destination_addr;         
    uint8_t     level;
    uint16_t    self_addr;
    uint8_t     hop;                    //Use for Exchange routing.
    bool        i_am_ch;                //Self is CH flag. 1 : true;0 : false.
    bool        ch_flag;                //Self can become to CH flag. 1:true;0:false.
};

typedef  struct __self_node_attribute SELF_NODE_ATTRIBUTE;
static SELF_NODE_ATTRIBUTE self_node_attr = {0};

//**-----------------------------------------Application-------------------------------------------------------**/
static uint32_t set_model_publish_address(uint16_t publish_address, access_model_handle_t model_handle)
{
    uint32_t status = NRF_SUCCESS;
    dsm_handle_t publish_address_handle = DSM_HANDLE_INVALID;

    access_model_publish_address_get(model_handle, &publish_address_handle);
    NRF_MESH_ASSERT(dsm_address_publish_remove(publish_address_handle) == NRF_SUCCESS);

    status = dsm_address_publish_add(publish_address, &publish_address_handle); 
    if (status != NRF_SUCCESS) {
        return status;
    } 
    else {
        return access_model_publish_address_set(model_handle, publish_address_handle);
    }
}

static uint16_t get_node_addr(void)
{
    dsm_local_unicast_address_t node_address;
    dsm_local_unicast_addresses_get(&node_address);

    return node_address.address_start;
}

//Start CH election for advertising process.
static void ch_election_start(void)
{
    uint32_t  err_code;

    err_code = app_timer_start(m_ch_election_id, CH_ELECTION_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);
}

//Start I am CH for advertising process.(CH & MNs routing exchange)
static void i_am_ch_start(void)
{
    uint32_t err_code;

    err_code = app_timer_start(m_i_am_ch_id, I_AM_CH_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);
}

//Start MNs exchange for advertising process.(CH & MNs routing exchange)
static void mn_ex_routing_start(void)
{
    uint32_t err_code;

    err_code = app_timer_start(m_mn_ex_routing_id, MN_EXCHANGE_ROUTING_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);
}


static void bat_publish_start(void)
{
    uint32_t err_code;

    err_code = app_timer_start(m_bat_publish_id,
                               BAT_PUBLISH_INTERVAL,
                               NULL);
    
    APP_ERROR_CHECK(err_code);
}
//**-----------------------------------------------------------------------------------------------------------**/
static void provisioning_complete_cb(void)
{
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Successfully provisioned\n");

    //uint16_t node_address;

    /* Restores the application parameters after switching from the Provisioning service to the Proxy  */
    gap_params_init();
    conn_params_init();

    self_node_attr.self_addr = get_node_addr();

    provision_flag = 1;
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Node Address: 0x%04x\n", self_node_attr.self_addr);

    hal_led_mask_set(LEDS_MASK, LED_MASK_STATE_OFF);
    hal_led_blink_ms(LEDS_MASK, LED_BLINK_INTERVAL_MS, LED_BLINK_CNT_PROV);
}

/******************************************************************************/
/*                          Clustering Header Election                        */
/******************************************************************************/
//Need add scan low level feature.
static void ch_election_priority_compare(uint16_t max_addr, uint8_t max_priority, uint16_t other_node)
{
    static uint8_t cnt = 0;
    static uint16_t array[10] = {0};
    static uint8_t adc_priority = 0;
    static uint16_t self_node_addr = 0;
    bool check_flag = 0;
    uint16_t addr_temp = 0;

    //First get self node addr.
    if(!self_node_addr) self_node_addr = get_node_addr();

    for(uint8_t i=0; i<=cnt; i++)
    {
        //__LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Array addr[%d] 0x%04x :: 0x%04x Other addr\n", i, array[i], other_node);
        if(array[i] == other_node)
        { 
            check_flag = 1;
            
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Check Same Address\n");
        }
    }

    //Self conn priority
    if(!check_flag)
    {
        array[cnt] = other_node;

        cnt++;
        adc_priority = (adc_value - 153)/10;

        ch.self_priority = cnt + adc_priority;

        __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Add Conn_Priority, Self Priority %d\n", ch.self_priority);
    }

    //ADC : 256 * 0.6 = 153
    if(adc_value > 180 && self_node_attr.ch_flag == 1)
    {
        //Receive max priority Compare self max priority.
        if(max_priority > ch.max_priority)
        {
            ch.max_priority = max_priority;
            ch.max_addr = max_addr;
        }else if (max_priority == ch.max_priority)
        {
            addr_temp = max_addr;
            //Receive max priority = Self max priority,but receive max addr < Self max addr.
            if(addr_temp < ch.max_addr)
            {
                ch.max_priority = max_priority;
                ch.max_addr = max_addr;
            }
        }

        //self max priority Compare self max priority.
        if(ch.self_priority > ch.max_priority)
        {
            ch.max_priority = ch.self_priority;
            ch.max_addr = other_node;
        }else if (ch.self_priority == ch.max_priority)
        {
            //Receive max priority = Self max priority,but receive max addr < Self max addr.
            if(self_node_addr < ch.max_addr)
            {
                ch.max_priority = ch.self_priority;
                ch.max_addr = self_node_addr;
            }
        }
    }else
    {
        //Receive max priority Compare self max priority.
        if(max_priority > ch.max_priority)
        {
            ch.max_priority = max_priority;
            ch.max_addr = max_addr;
        }else if (max_priority == ch.max_priority)
        {
            addr_temp = max_addr;
            //Receive max priority = Self max priority,but receive max addr < Self max addr.
            if(addr_temp < ch.max_addr)
            {
                ch.max_priority = max_priority;
                ch.max_addr = max_addr;
            }
        }
    }
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Receive MNs ADV\nMax Addr and Priority 0x%04x : %d\nSelf Addr and Priority 0x%04x : %d\n", ch.max_addr, ch.max_priority, self_node_addr, ch.self_priority);
}

/******************************************************************************/
/*                                Exchange Path                               */
/******************************************************************************/
static void mns_exchange_routing(uint8_t ch_flag, uint16_t src, uint8_t hop)
{
    static bool first_flag = 0;
    static uint8_t min_hop = 255;

    if(!first_flag)
    {
        first_flag = 1;
        mn_ex_routing_start();
    }
    
    if(hop < min_hop)
    {
        self_node_attr.hop = min_hop = hop;
        self_node_attr.destination_addr = src;
    }
}

//Input 1:CH 2:MNs
static void ch_exchange_routing(uint8_t input, uint16_t src, uint8_t level)
{
    static uint8_t compare_level = 0;
    
    if(!compare_level) compare_level = self_node_attr.level;

