Defklol/CNBBM/nRF5-SDK-for-Mesh-master/examples/Clustering_Network/node B/src/main.c
}

static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    uint32_t err_code;

    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(p_evt->conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
    else if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_SUCCEEDED)
    {
        __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Successfully updated connection parameters\n");
    }
}

static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

//**-----------------------------------------Driver Handler-------------------------------------------------------**/
void uart_event_handle(app_uart_evt_t * p_event)
{
    uint8_t        data[50];
    uint8_t        index = 0;
    static uint8_t count = 0;

    if (p_event->evt_type == APP_UART_COMMUNICATION_ERROR)
    {
        APP_ERROR_HANDLER(p_event->data.error_communication);

    }else if (p_event->evt_type == APP_UART_FIFO_ERROR)
    {
        APP_ERROR_HANDLER(p_event->data.error_code);

    }else if (p_event->evt_type == APP_UART_DATA_READY)
    {
        UNUSED_VARIABLE(app_uart_get(&data[index]));
        //__LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "%c", data[index]);
        if(data[index] == 0x0D)
        {
            count ++;
            if(count == 4)
            {
                __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Tx Done\n");
                count = 0;
            }
        }
    }
}

static void battery_publish_timeout_handler(void *p_context)
{
    static uint8_t status;
    static uint32_t times = 0;
    static uint32_t node_addr = 0;

    if(!node_addr) node_addr = get_node_addr();

    times = times%3; //1:1.2:2.3:3......(min)
    //__LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Times %d\n", times);  
    if(!times)
    {
        nrf_drv_saadc_sample_convert(0, &adc_value);
        
        status = simple_battery_client_set_unreliable(&m_bat_clients[0], adc_value, GROUP_MSG_REPEAT_COUNT, node_addr);
        if (status == NRF_SUCCESS)
        {
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Publish BAT value : %d to 0x%04x\n", adc_value, self_node_attr.destination_addr);
        }
    }
    times ++;
}

static void ch_election_timeout_handler(void *p_context)
{
    //ch = get_ch_node();
    ch_election_adv(ch.max_addr >> 8, ch.max_addr & 0xff, ch.max_priority);
}


static void i_am_ch_timeout_handler(void *p_context)
{
    i_am_ch_adv();
}

static void mn_ex_routing_timeout_handler(void *p_context)
{
    mn_routing_adv();
}

//**-----------------------------------------Stack Initial-------------------------------------------------------**/

static void mesh_init(void)
{
    uint8_t dev_uuid[NRF_MESH_UUID_SIZE];
    uint8_t node_uuid_prefix[SERVER_NODE_UUID_PREFIX_SIZE] = SERVER_NODE_UUID_PREFIX;

    ERROR_CHECK(mesh_app_uuid_gen(dev_uuid, node_uuid_prefix, SERVER_NODE_UUID_PREFIX_SIZE));

    mesh_stack_init_params_t init_params =
    {
        .core.irq_priority       = NRF_MESH_IRQ_PRIORITY_LOWEST,
        .core.lfclksrc           = DEV_BOARD_LF_CLK_CFG,
        //.core.p_uuid             = m_client_node_uuid,
        .core.p_uuid             = dev_uuid,
        .models.models_init_cb   = models_init_cb,
        .models.config_server_cb = config_server_evt_cb
    };
    ERROR_CHECK(mesh_stack_init(&init_params, &m_device_provisioned));
    
    //Start listening for incoming packets.
    nrf_mesh_rx_cb_set(rx_cb);
    
    //Start Advertising beacon
    adv_init();
}

static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);
}

static void conn_params_init(void)
{
    uint32_t               err_code;
    ble_conn_params_init_t cp_init;
    ble_gap_conn_params_t  gap_conn_params;

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));
    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);

    memset(&cp_init, 0, sizeof(cp_init));
    cp_init.p_conn_params                  = &gap_conn_params;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;

    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}

//**************                          Advertising Init              *************************/

/**
 * Status :
 * 1 : Devide level Mode.       BS_relay_adv(uint8_t rc_level, uint8_t relay_tid)
 * 2 : CH election Mode.        ch_election_adv(uint8_t max_addr_H, uint8_t max_addr_L, uint8_t max_priority)
 * 3 : I am CH broadcast adv.   i_am_ch_adv(void)
 * 4 : MNs exchange routing.    mn_routing_adv(void)
 */
static void adv_tx_complete_cb(advertiser_t *p_adv, nrf_mesh_tx_token_t token, uint32_t timestamp)
{ 
    if(p_adv->p_packet != NULL)
    {
        //__LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Tx Done\n");
        //advertiser_packet_discard(p_adv, p_adv->p_packet);

        //__LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Status %d,Tx Complete, timestamp %d\n", adv_packet_status, timestamp);
        advertiser_packet_discard(p_adv, p_adv->p_packet);
        advertiser_disable(p_adv);
    
    }
}

static void adv_init(void)
{
    advertiser_instance_init(&m_advertiser, adv_tx_complete_cb, m_adv_buffer, ADVERTISER_BUF_SIZE);
    advertiser_interval_set(&m_advertiser, BEACON_INTERVAL);
}

