Defklol/CNBBM/nRF5-SDK-for-Mesh-master/examples/Clustering_Network/node B/src/main.c
        }
    }else times ++;

}

//MNs change router.   status 4            
static void mn_routing_adv(void)
{
    adv_packet_status = 4;
    //static uint16_t node_address = 0;
    static uint8_t times = 0;
    dsm_handle_t add_addr_handle = DSM_HANDLE_INVALID;
    
    //if(!node_address) node_address = get_node_addr();
    
    advertiser_enable(&m_advertiser);
    static uint8_t adv_data[] = 
    {
        0x02, 0x01, 0x06,
        0x1a, 0xff, 0x00, 0xff,
        0x02, 0x15,
        0x38, 0x32, 0x89, 0xbf,
        0xde, 0xc2, 0x71, 0x84,
        0x4a, 0x47, 0x24, 0x82,
        MAJOR_LOCATE_H, MAJOR_LOCATE_L,   
        MINOR_LOCATE_H, MINOR_LOCATE_L,
        0x00, 0x00,                 //Self addr
        0x00, 0x00,                 //hop and level
        0x00                        //Destination addr can to bs flag.
    };

    adv_data[25] = (uint8_t)(self_node_attr.self_addr>>8);
    adv_data[26] = (uint8_t)(self_node_attr.self_addr&0xFF);
    adv_data[27] = self_node_attr.hop+1;
    adv_data[28] = self_node_attr.level;
    adv_data[29] = 1;

    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "\nMNs Routing Exchange\nSelf Addr 0x%02x%02x\nHop %d\nSelf level %d\nDestination Flag\n", adv_data[25], adv_data[26], adv_data[27], adv_data[28], adv_data[29]);

    adv_packet_t *p_packet = advertiser_packet_alloc(&m_advertiser, sizeof(adv_data));
    if(p_packet){
        memcpy(p_packet->packet.payload, adv_data, sizeof(adv_data));

        p_packet->config.repeats = ADVERTISER_REPEAT_INFINITE;

        advertiser_packet_send(&m_advertiser, p_packet);
    }

    if(times == MN_ROUTING_ADV_TIMEOUT)
    {
        app_timer_stop(m_mn_ex_routing_id);
        times = 0;
        __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "\nI am MNs\nSelf Addr 0x%04x publish destination addr 0x%04x\n", self_node_attr.self_addr, self_node_attr.destination_addr);

        set_model_publish_address(self_node_attr.destination_addr+2, m_bat_clients[0].model_handle);
        set_model_publish_address(self_node_attr.destination_addr+2, m_emh_clients[0].model_handle);
        bat_publish_start();

    }else times ++;
}

static void adv_disable(void)
{
    advertiser_disable(&m_advertiser);
}


//**************                              HAL Init                  *************************/
static void saadc_init()
{
    ret_code_t err_code;
  
    nrf_saadc_channel_config_t channel_config = NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_VDD);

    err_code = nrf_drv_saadc_init(NULL, NULL);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_saadc_channel_init(0, &channel_config);
    APP_ERROR_CHECK(err_code);
}

static void timer_create(void)
{
    uint32_t err_code;

    //Bat data trasnmit Timer.
    err_code = app_timer_create(&m_bat_publish_id,
                                APP_TIMER_MODE_REPEATED,
                                battery_publish_timeout_handler);
    APP_ERROR_CHECK(err_code);

    //CH election process Timer.
    err_code = app_timer_create(&m_ch_election_id,
                                APP_TIMER_MODE_REPEATED,
                                ch_election_timeout_handler);
    APP_ERROR_CHECK(err_code);

    //I am CH Timer.(combine MNs exchange routin)
    err_code = app_timer_create(&m_i_am_ch_id,
                                APP_TIMER_MODE_REPEATED,
                                i_am_ch_timeout_handler);
    APP_ERROR_CHECK(err_code);

    //MNs exchange routing Timer. (combine i am ch timer)
    err_code = app_timer_create(&m_mn_ex_routing_id,
                                APP_TIMER_MODE_REPEATED,
                                mn_ex_routing_timeout_handler);
    APP_ERROR_CHECK(err_code);
}

static void driver_init()
{
    saadc_init();
    timer_create();
}

static void initialize(void)
{
    __LOG_INIT(LOG_SRC_APP | LOG_SRC_ACCESS, LOG_LEVEL_INFO, LOG_CALLBACK_DEFAULT);
    //__LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "----- BLE Mesh Light Switch Client Demo -----\n");
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "----- Start -----\n");

    ERROR_CHECK(app_timer_init());
    hal_leds_init();

#if BUTTON_BOARD
    ERROR_CHECK(hal_buttons_init(button_event_handler));
#endif
    uint32_t err_code = nrf_sdh_enable_request();
    APP_ERROR_CHECK(err_code);

    uint32_t ram_start = 0;
    /* Set the default configuration (as defined through sdk_config.h). */
    err_code = nrf_sdh_ble_default_cfg_set(MESH_SOFTDEVICE_CONN_CFG_TAG, &ram_start);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_sdh_ble_enable(&ram_start);
    APP_ERROR_CHECK(err_code);

    gap_params_init();
    conn_params_init();
   
    mesh_init();
    driver_init();
}


static void start(void)
{
    //static uint16_t node_address;

    rtt_input_enable(rtt_input_handler, RTT_INPUT_POLL_PERIOD_MS);
    ERROR_CHECK(mesh_stack_start());

    if (!m_device_provisioned)
    {
        static const uint8_t static_auth_data[NRF_MESH_KEY_SIZE] = STATIC_AUTH_DATA;
        mesh_provisionee_start_params_t prov_start_params =
        {
            .p_static_data    = static_auth_data,
            .prov_complete_cb = provisioning_complete_cb,
            .p_device_uri = NULL
        };
        ERROR_CHECK(mesh_provisionee_prov_start(&prov_start_params));
    }else{
        //Get self node addr.
        self_node_attr.self_addr = get_node_addr();
        provision_flag = 1;
        __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Node Address: 0x%04x\n", self_node_attr.self_addr);
    }

    const uint8_t *p_uuid = nrf_mesh_configure_device_uuid_get();
    __LOG_XB(LOG_SRC_APP, LOG_LEVEL_INFO, "Device UUID ", p_uuid, NRF_MESH_UUID_SIZE);

    hal_led_mask_set(LEDS_MASK, LED_MASK_STATE_OFF);
    hal_led_blink_ms(LEDS_MASK, LED_BLINK_INTERVAL_MS, LED_BLINK_CNT_START);

}

int main(void)
{
    initialize();
    execution_start(start);

    nrf_drv_saadc_sample_convert(0, &adc_value);
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "ADC Value %d\n", adc_value);

    for (;;)
    {
        (void)sd_app_evt_wait();
    }
}
